lecture-15/notes.org
* More Python & Library Construction

1. Object Oriented Programming and Classes
2. Clarification on the Idea of Environments and Classes
3. How to Arrange A Python Project
4. How to Arrange an R library w/ Devtools
5. Test Driven Development 
6. Challenges w/ Statistical Frameworks and Tests

* More Python 

** Python Version Notes

1. There are two major versions of Python out there.
2. They are not source compatible.
3. Python 2.7 is still out there but not as common as it was
4. Python 3 is now pretty much standard.

** Major Differences

See [[https://sebastianraschka.com/Articles/2014_python_2_3_key_diff.html][this]]. Briefly:

1. print is a statement in python2 but a function in python3.
2. (statements are things that don't return a value and are not first class)
3. Differences in coercion when using mixed integer/float numbers
4. no xrange in python 3 - range is equivalent
5. for loop variables are private in python3

The main thing is be away that there are differences. Generally
speaking a Python 2 codebase will not run in Python 3. 

** Object Orientation and a Thematic Note

1. We will get to OO in Python in a Minute
2. But what is the _idea_ behind OO?

It is [[https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)][Encapsulation]]. 

** A brief aside about statistical mechanics

1. The second law says entropy always increases.
2. What is the intuition behind this rule? We expect that if we cannot
   make a precise measurement of a system then the degrees of freedom
   we can't measure are randomly distributed over their state space
   consistent with what we can measure.
3. Roughly speaking, the randomness of these unmeasured degrees of
   freedom correspond to the entropy of the system.
4. When you put two systems together in an unconstrained way the
   number of degrees of freedom goes like the product of the numbers
   for each individual system.
5. Thus the entropy has to increase.
6. The best case scenario is that you combine your systems in a
   delicate way that forbids most of the product states.

** Programs are Systems

1. They have states we can observe and states we cant 
2. When you put two programs together (eg, define two algorithms in
   the same program, for instance) then, naively, the number of states
   goes multiplicatively.
3. Encapsulation is an attempt to put sub-programs together in such a
   way as to limit the interaction between unrelated pieces of state
   and to therefore limit the entropy of the program.

** Environments

1. Environments are one way to limit cross talk
2. Functions in R are the usual way of limiting things
3. The big benefit is that the variables introduced in functions are
   typically _temporary_ to the body of the function.
4. Python has these kinds of environments as well.

** Object Oriented Programming

But what if we want _persistent_ state?

Objects to the rescue: objects are persistent environments which
typically represent individual entities of some kind.

** A (contrived) example

#+begin_src python 
x = [0,0,0]
y = [0,0,0]
xv = [0.1,0.1,0.3]
yv = [0.1,0.3,0.1]

dt = 0.25;
i = 1;

x[i] = x[i] + dt*xv[i];
# Imagine some complicated stuff happening
# maybe a while loop that accidentally uses i as
# an index the result of which is:
i = 2;
y[i] = y[i] + dt*yv[i];
#+end_src

The above result is totally inconsistent - we've mixed up velocities
between points 1 and 2. Our program is in an inconsistent state. 

** Now consider

#+begin_src python
class Point:
    x = 0.0
    y = 0.0
    vx = 0.0;
    vy = 0.0;

    def __init__(self, x, y, vx, vy):
        self.x = x;
        self.y = y;
        self.vx = vx;
        self.vy = vy;

    def update(self, dt):
        self.x = self.x + dt*self.vx;
        self.y = self.y + dt*self.vy;
        return self;

    def set_v(self, x, y):
        self.vx = x;
        self.vy = y;
        return self;

points = [Point(0.0,0.0,0.1,0.1),
          Point(0.0,0.0,0.1,0.3),
          Point(0.0,0.0,0.3,0.1)];

i = 1;
dt = 0.25;
pt = points[i];
# same complicated stuff that messes up i
pt.update(dt);

#+end_src

#+RESULTS:
: None

The encapsulation of the state of the point has prevented an error by forcing us to 

1. Address the point as a single thing rather than a disconnected set of things
2. Interact with the point via an _interface_ of _methods_.

