lecture-15/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-05 Mon 17:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vincent" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf7647d4">1. More Python &amp; Library Construction</a></li>
<li><a href="#orgabf6c28">2. More Python</a>
<ul>
<li><a href="#org8e9fba7">2.1. Python Version Notes</a></li>
<li><a href="#org4681fe0">2.2. Major Differences</a></li>
<li><a href="#orgea4b6d8">2.3. Object Orientation and a Thematic Note</a></li>
<li><a href="#org8875099">2.4. A brief aside about statistical mechanics</a></li>
<li><a href="#org073b7ad">2.5. Programs are Systems</a></li>
<li><a href="#org3eddf21">2.6. Environments</a></li>
<li><a href="#org2daf50e">2.7. Object Oriented Programming</a></li>
<li><a href="#orgab72b68">2.8. A (contrived) example</a></li>
<li><a href="#org2237959">2.9. Now consider</a></li>
<li><a href="#orgd8f6795">2.10. Vocabulary</a></li>
<li><a href="#org7e944d9">2.11. How do we do this in R?</a></li>
<li><a href="#org537d8b0">2.12. Warning:</a></li>
<li><a href="#org74f76ed">2.13. Inheritance</a></li>
<li><a href="#org4b93c5b">2.14. But there is more</a></li>
<li><a href="#org07de000">2.15. Inheritance and "looking up"</a></li>
<li><a href="#org5131b2b">2.16. Concepts</a></li>
<li><a href="#org856593b">2.17. Multiple Inheritance and Composition</a></li>
</ul>
</li>
<li><a href="#org566261f">3. Libraries</a>
<ul>
<li><a href="#org2ffa077">3.1. In Python</a></li>
<li><a href="#org1436cf7">3.2. Developing A Package</a></li>
<li><a href="#orgb6cf11b">3.3. Concepts</a></li>
<li><a href="#orgbe58fe2">3.4. The Package Ecosystem</a></li>
<li><a href="#orgd579e20">3.5. A full Python Package</a></li>
<li><a href="#orgf6e167f">3.6. What about R?</a></li>
<li><a href="#orgf256539">3.7. usethis</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf7647d4" class="outline-2">
<h2 id="orgf7647d4"><span class="section-number-2">1</span> More Python &amp; Library Construction</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Object Oriented Programming and Classes</li>
<li>Clarification on the Idea of Environments and Classes</li>
<li>How to Arrange A Python Project</li>
<li>How to Arrange an R library w/ Devtools</li>
<li>Test Driven Development</li>
<li>Challenges w/ Statistical Frameworks and Tests</li>
</ol>
</div>
</div>

<div id="outline-container-orgabf6c28" class="outline-2">
<h2 id="orgabf6c28"><span class="section-number-2">2</span> More Python</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8e9fba7" class="outline-3">
<h3 id="org8e9fba7"><span class="section-number-3">2.1</span> Python Version Notes</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>There are two major versions of Python out there.</li>
<li>They are not source compatible.</li>
<li>Python 2.7 is still out there but not as common as it was</li>
<li>Python 3 is now pretty much standard.</li>
</ol>
</div>
</div>

<div id="outline-container-org4681fe0" class="outline-3">
<h3 id="org4681fe0"><span class="section-number-3">2.2</span> Major Differences</h3>
<div class="outline-text-3" id="text-2-2">
<p>
See <a href="https://sebastianraschka.com/Articles/2014_python_2_3_key_diff.html">this</a>. Briefly:
</p>

<ol class="org-ol">
<li>print is a statement in python2 but a function in python3.</li>
<li>(statements are things that don't return a value and are not first class)</li>
<li>Differences in coercion when using mixed integer/float numbers</li>
<li>no xrange in python 3 - range is equivalent</li>
<li>for loop variables are private in python3</li>
</ol>

<p>
The main thing is be away that there are differences. Generally
speaking a Python 2 codebase will not run in Python 3. 
</p>
</div>
</div>

<div id="outline-container-orgea4b6d8" class="outline-3">
<h3 id="orgea4b6d8"><span class="section-number-3">2.3</span> Object Orientation and a Thematic Note</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>We will get to OO in Python in a Minute</li>
<li>But what is the <span class="underline">idea</span> behind OO?</li>
</ol>

<p>
It is <a href="https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)">Encapsulation</a>. 
</p>
</div>
</div>

<div id="outline-container-org8875099" class="outline-3">
<h3 id="org8875099"><span class="section-number-3">2.4</span> A brief aside about statistical mechanics</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>The second law says entropy always increases.</li>
<li>What is the intuition behind this rule? We expect that if we cannot
make a precise measurement of a system then the degrees of freedom
we can't measure are randomly distributed over their state space
consistent with what we can measure.</li>
<li>Roughly speaking, the randomness of these unmeasured degrees of
freedom correspond to the entropy of the system.</li>
<li>When you put two systems together in an unconstrained way the
number of degrees of freedom goes like the product of the numbers
for each individual system.</li>
<li>Thus the entropy has to increase.</li>
<li>The best case scenario is that you combine your systems in a
delicate way that forbids most of the product states.</li>
</ol>
</div>
</div>

<div id="outline-container-org073b7ad" class="outline-3">
<h3 id="org073b7ad"><span class="section-number-3">2.5</span> Programs are Systems</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>They have states we can observe and states we cant</li>
<li>When you put two programs together (eg, define two algorithms in
the same program, for instance) then, naively, the number of states
goes multiplicatively.</li>
<li>Encapsulation is an attempt to put sub-programs together in such a
way as to limit the interaction between unrelated pieces of state
and to therefore limit the entropy of the program.</li>
</ol>
</div>
</div>

<div id="outline-container-org3eddf21" class="outline-3">
<h3 id="org3eddf21"><span class="section-number-3">2.6</span> Environments</h3>
<div class="outline-text-3" id="text-2-6">
<ol class="org-ol">
<li>Environments are one way to limit cross talk</li>
<li>Functions in R are the usual way of limiting things</li>
<li>The big benefit is that the variables introduced in functions are
typically <span class="underline">temporary</span> to the body of the function.</li>
<li>Python has these kinds of environments as well.</li>
</ol>
</div>
</div>

<div id="outline-container-org2daf50e" class="outline-3">
<h3 id="org2daf50e"><span class="section-number-3">2.7</span> Object Oriented Programming</h3>
<div class="outline-text-3" id="text-2-7">
<p>
But what if we want <span class="underline">persistent</span> state?
</p>

<p>
Objects to the rescue: objects are persistent environments which
typically represent individual entities of some kind.
</p>
</div>
</div>

<div id="outline-container-orgab72b68" class="outline-3">
<h3 id="orgab72b68"><span class="section-number-3">2.8</span> A (contrived) example</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span> = [0,0,0]
<span style="color: #a0522d;">y</span> = [0,0,0]
<span style="color: #a0522d;">xv</span> = [0.1,0.1,0.3]
<span style="color: #a0522d;">yv</span> = [0.1,0.3,0.1]

<span style="color: #a0522d;">dt</span> = 0.25;
<span style="color: #a0522d;">i</span> = 1;

<span style="color: #a0522d;">x</span>[i] = x[i] + dt*xv[i];
<span style="color: #b22222;"># </span><span style="color: #b22222;">Imagine some complicated stuff happening</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">maybe a while loop that accidentally uses i as</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">an index the result of which is:</span>
<span style="color: #a0522d;">i</span> = 2;
<span style="color: #a0522d;">y</span>[i] = y[i] + dt*yv[i];
</pre>
</div>

<p>
The above result is totally inconsistent - we've mixed up velocities
between points 1 and 2. Our program is in an inconsistent state. 
</p>
</div>
</div>

<div id="outline-container-org2237959" class="outline-3">
<h3 id="org2237959"><span class="section-number-3">2.9</span> Now consider</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Point</span>:
    <span style="color: #a0522d;">x</span> = 0.0
    <span style="color: #a0522d;">y</span> = 0.0
    <span style="color: #a0522d;">vx</span> = 0.0;
    <span style="color: #a0522d;">vy</span> = 0.0;

    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, x, y, vx, vy):
        <span style="color: #a020f0;">self</span>.x = x;
        <span style="color: #a020f0;">self</span>.y = y;
        <span style="color: #a020f0;">self</span>.vx = vx;
        <span style="color: #a020f0;">self</span>.vy = vy;

    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">update</span>(<span style="color: #a020f0;">self</span>, dt):
        <span style="color: #a020f0;">self</span>.x = <span style="color: #a020f0;">self</span>.x + dt*<span style="color: #a020f0;">self</span>.vx;
        <span style="color: #a020f0;">self</span>.y = <span style="color: #a020f0;">self</span>.y + dt*<span style="color: #a020f0;">self</span>.vy;
        <span style="color: #a020f0;">return</span> <span style="color: #a020f0;">self</span>;

    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">set_v</span>(<span style="color: #a020f0;">self</span>, x, y):
        <span style="color: #a020f0;">self</span>.vx = x;
        <span style="color: #a020f0;">self</span>.vy = y;
        <span style="color: #a020f0;">return</span> <span style="color: #a020f0;">self</span>;

<span style="color: #a0522d;">points</span> = [Point(0.0,0.0,0.1,0.1),
          Point(0.0,0.0,0.1,0.3),
          Point(0.0,0.0,0.3,0.1)];

<span style="color: #a0522d;">i</span> = 1;
<span style="color: #a0522d;">dt</span> = 0.25;
<span style="color: #a0522d;">pt</span> = points[i];
<span style="color: #b22222;"># </span><span style="color: #b22222;">same complicated stuff that messes up i</span>
pt.update(dt);

</pre>
</div>

<p>
The encapsulation of the state of the point has prevented an error by forcing us to 
</p>

<ol class="org-ol">
<li>Address the point as a single thing rather than a disconnected set of things</li>
<li>Interact with the point via an <span class="underline">interface</span> of <span class="underline">methods</span>.</li>
</ol>
</div>
</div>
