lecture-15/notes.org
** Vocabulary

1. A "class" is a factory for "instances"
2. We create an "instance" by using the class name like a function.
3. The functions we define inside the class are "methods"
4. The variables inside the class are "properties"
5. It is ok to think of each "instance" having a copy of the "methods" and "properties".

** How do we do this in R?

R is less explicitly object oriented than Python and uses a very
different kind of object system. However, we might write:

#+begin_src R 
update <- function(object,dt) UseMethod("update");
setClass("Point",slots=list(x="numeric",
                            y="numeric",
                            xv="numeric",
                            yv="numeric"));
Point <- function(x,y,xv,yv){
    new("Point",x=x,y=y,xv=xv,yv=yv);
}
setMethod("update",c(object="Point",dt="numeric"),
          function(object, dt){
              object@x <- object@x + dt*object@xv;
              object@y <- object@y + dt*object$yv;
              object;
});
#+end_src

** Warning:

The objects in your program may not correspond to the objects in the
world.

Objects in a program typically disentangle elements of the program
rather than elements of reality.

This is probably obscure sounding and luckily you won't really need to
worry about it in data science unless you get into writing complicated
libraries.

ggplot is, however, a great example. A naive user might build a plot
library around plot types (scatter plots, box plots, line plots, etc)
but ggplot is designed around geometries, dimensions and aesthetics. 

** Inheritance

Inheritance is an important concept in OO programming. It operates in
both R and Python but you're much more likely to encounter it in
Python.

Inheritance is an "is a" relationship which can obtain between two
objects.

The prototypical example is that _everything_ in Python "is an"
object.

** But there is more

The `.` operator 

1. recall: `x.y` means "look up the item named y in the instance x"
2. recall: `x.y(a,b,c)` means "look up the method named y in the
   instance x and call it with the object x and the arguments a, b and
   c"

** Inheritance and "looking up"

Consider:

#+begin_src python :results output
class Person:
    name = "";
    def __init__(self, nm):
        self.name = nm;

    def __str__(self):
        return "Person: {0}".format(self.name);

    def get_name(self):
        return self.name;

    def greet_another(self, person):
        print("Hello {0}, my name is {1}".format(person.get_name(), self.get_name()));
        
class Employee(Person):
    company = "";
    def __init__(self,name,cmp):
        super().__init__(name);
        self.company = cmp;
    
    def __str__(self):
        return super().__str__() + (", Employed at: {0}".format(self.company));

p1 = Person("Ted Leo");
p2 = Person("Buffy Summers");
e = Employee("Marcia Brady", "Sensus");
print(p)
print(e)
p1.greet_another(p2);
p2.greet_another(e);
e.greet_another(p1);
#+end_src

#+RESULTS:
: Person: Ted Leo
: Person: Marcia Brady, Employed at: Sensus

** Concepts

1. Polymorphism: by providing an implementation of =__str__= to each
   class we allow the "print" function to do different things for
   different objects.
2. =super= classes - the "Person" class is a "super" class of
   "Employee".
3. We "override" the =__str__= method in both Person and Employee.
4. Note that we "inherit" the method ==greet_another== from Person in
   the Employee class.
5. And note that "Employees" "are" "People" - they can do everything a
   person does and more.

** Multiple Inheritance and Composition

In Python, but not in many programming languages, Classes can only
have a single parent class.

As you might imagine this restricts the expressiveness of classes. 

A classic example:

Car and Boat are both subclasses of "Vehicle". But there are things
which can move on land and in water. Are these descended from "Car" or
"Boat?"

Perhaps its better to merely have a "Vehicle" class and another class
for "Capabilities" and have the Vehicle keep a list of "Capabilities"
like "CanFly", "CanFloat", "CanDrive", etc.

This is, by the way, a good example of the objects you need not
mapping directly onto the objects in the real world.

* Libraries

1. A library is a collection of objects, methods, functions which are
   meant to be used by other people to develop applications or data
   analyses.
2. Most of the time data scientists are writing scripts - small,
   isolated tasks orchestrated by a make file with the final end being
   a report.
3. Sometimes data scientists write _applications_ as we might do with
   Shiny.
4. But sometimes we might want or need to write a _library_.

