lecture-15/notes.html

<div id="outline-container-orgd8f6795" class="outline-3">
<h3 id="orgd8f6795"><span class="section-number-3">2.10</span> Vocabulary</h3>
<div class="outline-text-3" id="text-2-10">
<ol class="org-ol">
<li>A "class" is a factory for "instances"</li>
<li>We create an "instance" by using the class name like a function.</li>
<li>The functions we define inside the class are "methods"</li>
<li>The variables inside the class are "properties"</li>
<li>It is ok to think of each "instance" having a copy of the "methods" and "properties".</li>
</ol>
</div>
</div>

<div id="outline-container-org7e944d9" class="outline-3">
<h3 id="org7e944d9"><span class="section-number-3">2.11</span> How do we do this in R?</h3>
<div class="outline-text-3" id="text-2-11">
<p>
R is less explicitly object oriented than Python and uses a very
different kind of object system. However, we might write:
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #0000ff;">update</span> <span style="color: #008b8b;">&lt;-</span> <span style="color: #a020f0;">function</span>(object,dt) UseMethod(<span style="color: #8b2252;">"update"</span>);
setClass(<span style="color: #8b2252;">"Point"</span>,slots=list(x=<span style="color: #8b2252;">"numeric"</span>,
                            y=<span style="color: #8b2252;">"numeric"</span>,
                            xv=<span style="color: #8b2252;">"numeric"</span>,
                            yv=<span style="color: #8b2252;">"numeric"</span>));
<span style="color: #0000ff;">Point</span> <span style="color: #008b8b;">&lt;-</span> <span style="color: #a020f0;">function</span>(x,y,xv,yv){
    new(<span style="color: #8b2252;">"Point"</span>,x=x,y=y,xv=xv,yv=yv);
}
setMethod(<span style="color: #8b2252;">"update"</span>,c(object=<span style="color: #8b2252;">"Point"</span>,dt=<span style="color: #8b2252;">"numeric"</span>),
          <span style="color: #a020f0;">function</span>(object, dt){
              object@x <span style="color: #008b8b;">&lt;-</span> object@x + dt*object@xv;
              object@y <span style="color: #008b8b;">&lt;-</span> object@y + dt*object$yv;
              object;
});
</pre>
</div>
</div>
</div>

<div id="outline-container-org537d8b0" class="outline-3">
<h3 id="org537d8b0"><span class="section-number-3">2.12</span> Warning:</h3>
<div class="outline-text-3" id="text-2-12">
<p>
The objects in your program may not correspond to the objects in the
world.
</p>

<p>
Objects in a program typically disentangle elements of the program
rather than elements of reality.
</p>

<p>
This is probably obscure sounding and luckily you won't really need to
worry about it in data science unless you get into writing complicated
libraries.
</p>

<p>
ggplot is, however, a great example. A naive user might build a plot
library around plot types (scatter plots, box plots, line plots, etc)
but ggplot is designed around geometries, dimensions and aesthetics. 
</p>
</div>
</div>

<div id="outline-container-org74f76ed" class="outline-3">
<h3 id="org74f76ed"><span class="section-number-3">2.13</span> Inheritance</h3>
<div class="outline-text-3" id="text-2-13">
<p>
Inheritance is an important concept in OO programming. It operates in
both R and Python but you're much more likely to encounter it in
Python.
</p>

<p>
Inheritance is an "is a" relationship which can obtain between two
objects.
</p>

<p>
The prototypical example is that <span class="underline">everything</span> in Python "is an"
object.
</p>
</div>
</div>

<div id="outline-container-org4b93c5b" class="outline-3">
<h3 id="org4b93c5b"><span class="section-number-3">2.14</span> But there is more</h3>
<div class="outline-text-3" id="text-2-14">
<p>
The `.` operator 
</p>

<ol class="org-ol">
<li>recall: `x.y` means "look up the item named y in the instance x"</li>
<li>recall: `x.y(a,b,c)` means "look up the method named y in the
instance x and call it with the object x and the arguments a, b and
c"</li>
</ol>
</div>
</div>

<div id="outline-container-org07de000" class="outline-3">
<h3 id="org07de000"><span class="section-number-3">2.15</span> Inheritance and "looking up"</h3>
<div class="outline-text-3" id="text-2-15">
<p>
Consider:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Person</span>:
    <span style="color: #a0522d;">name</span> = <span style="color: #8b2252;">""</span>;
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, nm):
        <span style="color: #a020f0;">self</span>.name = nm;

    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__str__</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Person: {0}"</span>.<span style="color: #483d8b;">format</span>(<span style="color: #a020f0;">self</span>.name);

    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get_name</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">return</span> <span style="color: #a020f0;">self</span>.name;

    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">greet_another</span>(<span style="color: #a020f0;">self</span>, person):
        <span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"Hello {0}, my name is {1}"</span>.<span style="color: #483d8b;">format</span>(person.get_name(), <span style="color: #a020f0;">self</span>.get_name()));

<span style="color: #a020f0;">class</span> <span style="color: #228b22;">Employee</span>(Person):
    <span style="color: #a0522d;">company</span> = <span style="color: #8b2252;">""</span>;
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>,name,<span style="color: #483d8b;">cmp</span>):
        <span style="color: #483d8b;">super</span>().__init__(name);
        <span style="color: #a020f0;">self</span>.company = <span style="color: #483d8b;">cmp</span>;

    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__str__</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">return</span> <span style="color: #483d8b;">super</span>().__str__() + (<span style="color: #8b2252;">", Employed at: {0}"</span>.<span style="color: #483d8b;">format</span>(<span style="color: #a020f0;">self</span>.company));

<span style="color: #a0522d;">p1</span> = Person(<span style="color: #8b2252;">"Ted Leo"</span>);
<span style="color: #a0522d;">p2</span> = Person(<span style="color: #8b2252;">"Buffy Summers"</span>);
<span style="color: #a0522d;">e</span> = Employee(<span style="color: #8b2252;">"Marcia Brady"</span>, <span style="color: #8b2252;">"Sensus"</span>);
<span style="color: #a020f0;">print</span>(p)
<span style="color: #a020f0;">print</span>(e)
p1.greet_another(p2);
p2.greet_another(e);
e.greet_another(p1);
</pre>
</div>
</div>
</div>

<div id="outline-container-org5131b2b" class="outline-3">
<h3 id="org5131b2b"><span class="section-number-3">2.16</span> Concepts</h3>
<div class="outline-text-3" id="text-2-16">
<ol class="org-ol">
<li>Polymorphism: by providing an implementation of <code>__str__</code> to each
class we allow the "print" function to do different things for
different objects.</li>
<li><code>super</code> classes - the "Person" class is a "super" class of
"Employee".</li>
<li>We "override" the <code>__str__</code> method in both Person and Employee.</li>
<li>Note that we "inherit" the method <code>=greet_another=</code> from Person in
the Employee class.</li>
<li>And note that "Employees" "are" "People" - they can do everything a
person does and more.</li>
</ol>
</div>
</div>

<div id="outline-container-org856593b" class="outline-3">
<h3 id="org856593b"><span class="section-number-3">2.17</span> Multiple Inheritance and Composition</h3>
<div class="outline-text-3" id="text-2-17">
<p>
In Python, but not in many programming languages, Classes can only
have a single parent class.
</p>

<p>
As you might imagine this restricts the expressiveness of classes. 
</p>

<p>
A classic example:
</p>

<p>
Car and Boat are both subclasses of "Vehicle". But there are things
which can move on land and in water. Are these descended from "Car" or
"Boat?"
</p>

<p>
Perhaps its better to merely have a "Vehicle" class and another class
for "Capabilities" and have the Vehicle keep a list of "Capabilities"
like "CanFly", "CanFloat", "CanDrive", etc.
</p>

<p>
This is, by the way, a good example of the objects you need not
mapping directly onto the objects in the real world.
</p>
</div>
</div>
</div>

<div id="outline-container-org566261f" class="outline-2">
<h2 id="org566261f"><span class="section-number-2">3</span> Libraries</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>A library is a collection of objects, methods, functions which are
meant to be used by other people to develop applications or data
analyses.</li>
<li>Most of the time data scientists are writing scripts - small,
isolated tasks orchestrated by a make file with the final end being
a report.</li>
<li>Sometimes data scientists write <span class="underline">applications</span> as we might do with
Shiny.</li>
<li>But sometimes we might want or need to write a <span class="underline">library</span>.</li>
</ol>
</div>
