lecture-15/notes.org
** In Python

1. The basic unit of code organization in python is a module.
2. In contrast to R, where we used files and "sourced" them, in python
   any file at all is a module which we can import

eg: if we put the above class definitions into "people.py" and then:

#+begin_src python :results output
import people

p1 = people.Person("Abe Lincoln");
p1.greet_another(p1);

#+end_src

#+RESULTS:
: Hello Abe Lincoln, my name is Abe Lincoln

Any variables or functions we define will be accessible on the object
which "import" creates.

People do not ordinarily "source" python files.

But you can say:

#+begin_src python :results output
from people import *
p1 = Person("Martin Van Buren");
p2 = Person("Frasier Crane");
p1.greet_another(p2);
#+end_src

#+RESULTS:
: Hello Frasier Crane, my name is Martin Van Buren

Sometimes its nice to import a library without polluting the whole
global namespace in your file but with a shorter name.

#+begin_src python :results output
import people as ppl
p1 = ppl.Person("Batman");
p2 = ppl.Person("Stanislaw Lem");
p2.greet_another(p1)
#+end_src

#+RESULTS:
: Hello Batman, my name is Stanislaw Lem

** Developing A Package

At a minimum a package is a directory with an __init__.py script.

See expkg/__init__.py

#+begin_src python :results output
import expkg

c = expkg.Carrot("winter",3);
print(c.get_bite_sound())

#+end_src

#+RESULTS:
: crunch

We can put other python files in the directory with the init file and
import them like this:

#+begin_src python :results output
from expkg import advanced_vegetables

r = advanced_vegetables.Eggplant("summer",2);
print(r.get_bite_sound())

#+end_src

#+RESULTS:
: soft crunch

** Concepts

1. We can import from the local __init__.py by saying "import . as
   lcl" or "from . import".
2. This allows us to organize our code into sub-files and modules in
   an overarching package.

** The Package Ecosystem

Before we get into the details of how to organize a Python package we
should discuss Anaconda and Pip.

1. pip is more or less the direct analog of R's "install.packages". It
   installs Python packages for the associated Python
   environment. Sometimes you see operating systems with pip and pip3
   where pip3 installs for the python3 on the system.
2. Anaconda is a broader system that can install binary packages for
   and including Python and other languages. Anaconda also manages
   environments.
3. Anaconda is widely used among data scientists. I use Docker and Pip
   instead, usually. Anaconda has a complicated SAT-Solver based
   dependency management system which is non-deterministic and has
   given me a lot of trouble.
4. Environments should be handled with Docker anyway.

** A full Python Package

An example is [[https://packaging.python.org/tutorials/packaging-projects/][here]].

There are some tools (less than standard) for generating a project
template. 

#+begin_src 
pip3 install cookiecutter
# The following is interactive
# toups@rs:~/work/bios-611/lecture-15$ python3 -m cookiecutter gh:TezRomacH/python-package-template
# You've downloaded /home/toups/.cookiecutters/python-package-template before. Is it okay to delete and re-download it? [yes]: yes
# project_name [python-project]: expkg2
# project_description [Awesome `expkg2` is a Python cli/package created with https://github.com/TezRomacH/python-package-template]: An example package.
# organization [expkg2]: 
# Select license:
# 1 - MIT
# 2 - BSD-3
# 3 - GNU GPL v3.0
# 4 - Apache Software License 2.0
# Choose from 1, 2, 3, 4 [1]: 1
# version [0.1.0]: 
# github_name [expkg2]: 
# email [hello@expkg2.com]: 
# sh: 1: lice: not found
# 32512
# 
# Your project expkg2 is created.
# 
# 1) Now you can start working on it:
# 
#     $ cd expkg2 && git init
# 
# 2) If you don't have Poetry installed run:
# 
#     $ make download-poetry
# 
# 3) Initialize poetry and install pre-commit hooks:
# 
#     $ make install
# 
# 4) Run codestyle:
# 
#     $ git add . && make install
# 
# 5) Upload initial code to GitHub (ensure you've run `make install` to use `pre-commit`):
# 
#     $ git add .
#     $ git commit -m ":tada: Initial commit"
#     $ git remote add origin https://github.com/expkg2/expkg2.git
#     $ git push -u origin master

#+end_src

** What about R?

Creating a library in R is arguably more important than in Python
because there really isn't any intermediate abstraction like a module.

Luckily for us, R makes it easier to do that Python does, thanks to
the Tidyverse.

** usethis

1. Can automatically generate a package
2. I recommend putting the package itself in a sub-directory for use
   with Docker

#+begin_src R
library(usethis);
#create_package("rpkgex")
#+end_src

Let's explore.

