lecture-15/notes.html

<div id="outline-container-org2ffa077" class="outline-3">
<h3 id="org2ffa077"><span class="section-number-3">3.1</span> In Python</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>The basic unit of code organization in python is a module.</li>
<li>In contrast to R, where we used files and "sourced" them, in python
any file at all is a module which we can import</li>
</ol>

<p>
eg: if we put the above class definitions into "people.py" and then:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> people

<span style="color: #a0522d;">p1</span> = people.Person(<span style="color: #8b2252;">"Abe Lincoln"</span>);
p1.greet_another(p1);

</pre>
</div>

<p>
Any variables or functions we define will be accessible on the object
which "import" creates.
</p>

<p>
People do not ordinarily "source" python files.
</p>

<p>
But you can say:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">from</span> people <span style="color: #a020f0;">import</span> *
<span style="color: #a0522d;">p1</span> = Person(<span style="color: #8b2252;">"Martin Van Buren"</span>);
<span style="color: #a0522d;">p2</span> = Person(<span style="color: #8b2252;">"Frasier Crane"</span>);
p1.greet_another(p2);
</pre>
</div>

<p>
Sometimes its nice to import a library without polluting the whole
global namespace in your file but with a shorter name.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> people <span style="color: #a020f0;">as</span> ppl
<span style="color: #a0522d;">p1</span> = ppl.Person(<span style="color: #8b2252;">"Batman"</span>);
<span style="color: #a0522d;">p2</span> = ppl.Person(<span style="color: #8b2252;">"Stanislaw Lem"</span>);
p2.greet_another(p1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1436cf7" class="outline-3">
<h3 id="org1436cf7"><span class="section-number-3">3.2</span> Developing A Package</h3>
<div class="outline-text-3" id="text-3-2">
<p>
At a minimum a package is a directory with an <span class="underline"><span class="underline">init</span></span>.py script.
</p>

<p>
See expkg/_<sub>init</sub>_<sub>.py</sub>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> expkg

<span style="color: #a0522d;">c</span> = expkg.Carrot(<span style="color: #8b2252;">"winter"</span>,3);
<span style="color: #a020f0;">print</span>(c.get_bite_sound())

</pre>
</div>

<p>
We can put other python files in the directory with the init file and
import them like this:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">from</span> expkg <span style="color: #a020f0;">import</span> advanced_vegetables

<span style="color: #a0522d;">r</span> = advanced_vegetables.Eggplant(<span style="color: #8b2252;">"summer"</span>,2);
<span style="color: #a020f0;">print</span>(r.get_bite_sound())

</pre>
</div>
</div>
</div>

<div id="outline-container-orgb6cf11b" class="outline-3">
<h3 id="orgb6cf11b"><span class="section-number-3">3.3</span> Concepts</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li>We can import from the local <span class="underline"><span class="underline">init</span></span>.py by saying "import . as
lcl" or "from . import".</li>
<li>This allows us to organize our code into sub-files and modules in
an overarching package.</li>
</ol>
</div>
</div>

<div id="outline-container-orgbe58fe2" class="outline-3">
<h3 id="orgbe58fe2"><span class="section-number-3">3.4</span> The Package Ecosystem</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Before we get into the details of how to organize a Python package we
should discuss Anaconda and Pip.
</p>

<ol class="org-ol">
<li>pip is more or less the direct analog of R's "install.packages". It
installs Python packages for the associated Python
environment. Sometimes you see operating systems with pip and pip3
where pip3 installs for the python3 on the system.</li>
<li>Anaconda is a broader system that can install binary packages for
and including Python and other languages. Anaconda also manages
environments.</li>
<li>Anaconda is widely used among data scientists. I use Docker and Pip
instead, usually. Anaconda has a complicated SAT-Solver based
dependency management system which is non-deterministic and has
given me a lot of trouble.</li>
<li>Environments should be handled with Docker anyway.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd579e20" class="outline-3">
<h3 id="orgd579e20"><span class="section-number-3">3.5</span> A full Python Package</h3>
<div class="outline-text-3" id="text-3-5">
<p>
An example is <a href="https://packaging.python.org/tutorials/packaging-projects/">here</a>.
</p>

<p>
There are some tools (less than standard) for generating a project
template. 
</p>

<pre class="example">
pip3 install cookiecutter
# The following is interactive
# toups@rs:~/work/bios-611/lecture-15$ python3 -m cookiecutter gh:TezRomacH/python-package-template
# You've downloaded /home/toups/.cookiecutters/python-package-template before. Is it okay to delete and re-download it? [yes]: yes
# project_name [python-project]: expkg2
# project_description [Awesome `expkg2` is a Python cli/package created with https://github.com/TezRomacH/python-package-template]: An example package.
# organization [expkg2]: 
# Select license:
# 1 - MIT
# 2 - BSD-3
# 3 - GNU GPL v3.0
# 4 - Apache Software License 2.0
# Choose from 1, 2, 3, 4 [1]: 1
# version [0.1.0]: 
# github_name [expkg2]: 
# email [hello@expkg2.com]: 
# sh: 1: lice: not found
# 32512
# 
# Your project expkg2 is created.
# 
# 1) Now you can start working on it:
# 
#     $ cd expkg2 &amp;&amp; git init
# 
# 2) If you don't have Poetry installed run:
# 
#     $ make download-poetry
# 
# 3) Initialize poetry and install pre-commit hooks:
# 
#     $ make install
# 
# 4) Run codestyle:
# 
#     $ git add . &amp;&amp; make install
# 
# 5) Upload initial code to GitHub (ensure you've run `make install` to use `pre-commit`):
# 
#     $ git add .
#     $ git commit -m ":tada: Initial commit"
#     $ git remote add origin https://github.com/expkg2/expkg2.git
#     $ git push -u origin master

</pre>
</div>
</div>

<div id="outline-container-orgf6e167f" class="outline-3">
<h3 id="orgf6e167f"><span class="section-number-3">3.6</span> What about R?</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Creating a library in R is arguably more important than in Python
because there really isn't any intermediate abstraction like a module.
</p>

<p>
Luckily for us, R makes it easier to do that Python does, thanks to
the Tidyverse.
</p>
</div>
</div>

<div id="outline-container-orgf256539" class="outline-3">
<h3 id="orgf256539"><span class="section-number-3">3.7</span> usethis</h3>
<div class="outline-text-3" id="text-3-7">
<ol class="org-ol">
<li>Can automatically generate a package</li>
<li>I recommend putting the package itself in a sub-directory for use
with Docker</li>
</ol>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #008b8b;">library</span>(usethis);
<span style="color: #b22222;">#</span><span style="color: #b22222;">create_package("rpkgex")</span>
</pre>
</div>

<p>
Let's explore.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vincent</p>
<p class="date">Created: 2020-10-05 Mon 17:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
